Autodesk.Revit.DB.ImportAXMUtil.AppendShapesToImportSymbol(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{Autodesk.Revit.DB.Transform},System.Collections.Generic.IList{System.String})
Append geometries to primary import symbol.
Support to reuse the same part of geometries as secondary import symbol
and instatiate with different transforms.
The id of primary import symbol.
The unique name of secondary import symbol.
The geometries to append.
The array of all geometries' layer name.
The array of all instances' transform.
The array of all instances' layer name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ImportAXMUtil
ImportAXMUtil contains some helper functions exposed to FormItConverter.